# Pandas

In [55]:
import numpy as np
import pandas as pd

## 1. Series

In [56]:
a = pd.Series([1200,4000,"Ely",6000,2900, "Lutfi", 789.3])
print(a) #dtype = object

0     1200
1     4000
2      Ely
3     6000
4     2900
5    Lutfi
6    789.3
dtype: object

In [57]:
b = pd.Series([1200,4000,6000,2900,789])
print(b) #dtype = int64

0    1200
1    4000
2    6000
3    2900
4     789
dtype: int64

In [58]:
c = pd.Series([122.4,5.334,565.3])
print(c) #dtype = float

0    122.400
1      5.334
2    565.300
dtype: float64

In [59]:
revenues = pd.Series([5555,7000,1980])

In [60]:
revenues

0    5555
1    7000
2    1980
dtype: int64

In [61]:
revenues.values #return the values in Series

array([5555, 7000, 1980], dtype=int64)

In [62]:
revenues.index #index (default, start=0)

RangeIndex(start=0, stop=3, step=1)

In [63]:
pd.Series([10,20,30,40,50], 
        index=['A','B','C','D','E']
        )

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [64]:
city_revenues = pd.Series(
    [4200,5000,6000],
    index=["Bogor","Jakarta", "Depok"]
)

In [65]:
city_revenues

Bogor      4200
Jakarta    5000
Depok      6000
dtype: int64

In [66]:
# dalam bentuk dictionary (key:value)
city_employee_count = pd.Series({"Jakarta": 5, "Padang":3})
city_employee_count

Jakarta    5
Padang     3
dtype: int64

In [67]:
# pengingat
# List : '[]' '[1,2,3,4,5]' 'bisa diubah isi elementnya'
# Tuple : '()' (1,2,3,4,5) 'tidak bisa diubah isi elementnya'
# Dict : '{}' {key:value}

In [68]:
city_employee_count.keys() #melihat keys di dict

Index(['Jakarta', 'Padang'], dtype='object')

In [69]:
"Padang" in city_employee_count.keys()

True

In [70]:
"Surabaya" in city_employee_count.keys()

False

## 2. DataFrame

keliatan tabelnya di array/seriesnya

In [71]:
city_revenues

Bogor      4200
Jakarta    5000
Depok      6000
dtype: int64

In [72]:
city_employee_count

Jakarta    5
Padang     3
dtype: int64

In [73]:
city_data = pd.DataFrame(
    {
        'revenue': city_revenues,
        'employee_count':city_employee_count
    }
)

city_data

         revenue  employee_count
Bogor     4200.0             NaN
Depok     6000.0             NaN
Jakarta   5000.0             5.0
Padang       NaN             3.0

In [74]:
#NaN (Not a Number = missing value)

In [75]:
city_data.index #sering dipakai

Index(['Bogor', 'Depok', 'Jakarta', 'Padang'], dtype='object')

In [76]:
city_data.values

array([[4.2e+03,     nan],
       [6.0e+03,     nan],
       [5.0e+03, 5.0e+00],
       [    nan, 3.0e+00]])

In [77]:
city_data.axes

[Index(['Bogor', 'Depok', 'Jakarta', 'Padang'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [78]:
#axes[0] => index
city_data.axes[0]

Index(['Bogor', 'Depok', 'Jakarta', 'Padang'], dtype='object')

In [79]:
#axes[1] => kolom
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [80]:
city_data.keys()

Index(['revenue', 'employee_count'], dtype='object')

In [81]:
city_data.columns #sering dipakai

Index(['revenue', 'employee_count'], dtype='object')

In [82]:
city_data

         revenue  employee_count
Bogor     4200.0             NaN
Depok     6000.0             NaN
Jakarta   5000.0             5.0
Padang       NaN             3.0

In [83]:
"Padang" in city_data

False

In [84]:
"revenue" in city_data #dilihat dari kolom/keys

True

## Accessing Series Elements

cara mengakses elemen di series = merujuk pada index

In [85]:
city_revenues

Bogor      4200
Jakarta    5000
Depok      6000
dtype: int64

In [86]:
city_revenues["Depok"]

6000

In [87]:
city_revenues[1] #Jakarta

5000

In [88]:
city_revenues[-1]

6000

In [89]:
city_revenues[1:]

Jakarta    5000
Depok      6000
dtype: int64

In [90]:
city_revenues["Jakarta":]

Jakarta    5000
Depok      6000
dtype: int64

### Using .loc and .iloc

In [91]:
colors = pd.Series(
    ['red','blue','green','yellow','purple'],
    index=[1,2,3,5,8]
)

In [92]:
colors

1       red
2      blue
3     green
5    yellow
8    purple
dtype: object

In [93]:
colors[1] # melihat ke apa yg terlihat di seriesnya

'red'

In [94]:
#.loc refers to the label index
#.iloc refers to the positional index

In [95]:
colors.loc[1] # merujuk ke label index yg ditampilkan

'red'

In [96]:
colors.iloc[1] # merujuk ke posisi index

'blue'

In [97]:
colors

1       red
2      blue
3     green
5    yellow
8    purple
dtype: object

In [98]:
colors.iloc[1:3]

2     blue
3    green
dtype: object

In [99]:
colors.loc[1:3]

1      red
2     blue
3    green
dtype: object

In [100]:
city_revenues

Bogor      4200
Jakarta    5000
Depok      6000
dtype: int64

In [101]:
city_revenues.loc["Jakarta"]

5000

## Accessing DataFrmae Elements

Merujuk ke kolom

In [102]:
city_data

         revenue  employee_count
Bogor     4200.0             NaN
Depok     6000.0             NaN
Jakarta   5000.0             5.0
Padang       NaN             3.0

In [103]:
city_data["revenue"]

Bogor      4200.0
Depok      6000.0
Jakarta    5000.0
Padang        NaN
Name: revenue, dtype: float64

In [104]:
city_data["employee_count"]

Bogor      NaN
Depok      NaN
Jakarta    5.0
Padang     3.0
Name: employee_count, dtype: float64

In [105]:
city_data.employee_count

Bogor      NaN
Depok      NaN
Jakarta    5.0
Padang     3.0
Name: employee_count, dtype: float64

In [106]:
city_data

         revenue  employee_count
Bogor     4200.0             NaN
Depok     6000.0             NaN
Jakarta   5000.0             5.0
Padang       NaN             3.0

In [107]:
city_data.loc["Jakarta"]

revenue           5000.0
employee_count       5.0
Name: Jakarta, dtype: float64

In [108]:
city_data.loc["Bogor" : "Depok"]

       revenue  employee_count
Bogor   4200.0             NaN
Depok   6000.0             NaN

In [109]:
city_data.loc["Depok":"Padang", "revenue"] #loc[rownya apa, kolomnya apa]

Depok      6000.0
Jakarta    5000.0
Padang        NaN
Name: revenue, dtype: float64

In [110]:
city_data.loc["Depok":"Padang", ["revenue","employee_count"]]

         revenue  employee_count
Depok     6000.0             NaN
Jakarta   5000.0             5.0
Padang       NaN             3.0

In [111]:
city_revenues

Bogor      4200
Jakarta    5000
Depok      6000
dtype: int64

In [112]:
city_revenues.sum()

15200

In [113]:
city_revenues.max()

6000

In [114]:
city_revenues.mean()

5066.666666666667

## Combining Multiple Dataset

Menggabungkan DataFrame

In [115]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [116]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [117]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [118]:
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [119]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [120]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [121]:
#pd.concat([dataPertama, dataKedua]) Gabungin ke bawah/vertical

In [122]:
all_city_data = pd.concat([city_data, further_city_data], sort=False) #disarankan sort=False aja

In [123]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [124]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

In [125]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [126]:
#gabungin secara horizontal
cities = pd.concat([all_city_data,city_countries], axis=1, sort=False)

In [127]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [128]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [129]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [130]:
#Note how Pandas added NaN for the missing values.

#If you want to combine only the cities that appear in both #DataFrame objects, then you can set the join parameter to inner:

#inner => irisan(?) indexnya ada di all_city maupun di city_countries
pd.concat([all_city_data, city_countries], axis=1, join="inner")

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Toronto       8000             NaN   Canada        0
Barcelona     3400             2.0    Spain        0

In [131]:
#While it’s most straightforward to combine data based on the #index, it’s not the only possibility. You can use .merge() to #implement a join operation similar to the one from SQL:

In [132]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

In [133]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [134]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [138]:
pd.merge(cities, countries, left_on="country", right_index=True) 
#left_on="country" artinya kita butuh kolom country di cities dan index di countries

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,6500.0,8.0,Japan,1.0,127,Asia
Toronto,8000.0,NaN,Canada,0.0,37,North America

In [136]:
# Note that the result contains only the cities where the country is known and appears in the joined DataFrame.

#.merge() performs an inner join by default. If you want to include all cities in the result, then you need to provide the how parameter:

In [137]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="left"
)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17.0,Europe
Tokyo,6500.0,8.0,Japan,1.0,127.0,Asia
Toronto,8000.0,NaN,Canada,0.0,37.0,North America
New York,7000.0,2.0,NaN,NaN,NaN,NaN
Barcelona,3400.0,2.0,Spain,0.0,NaN,NaN
Rotterdam,NaN,NaN,Holland,0.0,17.0,Europe